In [2]:
import pandas as pd
import numpy as np

In [6]:
# Read csv files to pandas dataframe
# MDO stands for mortgage debt out standing, S is for 1-4 unit and M is for multifamily
MDO_S_06 = pd.read_csv('Data/1_4_family_2006_2009.csv')
MDO_S_16 = pd.read_csv('Data/1_4_family_2016_2019.csv')
MDO_M_06 = pd.read_csv('Data/multi_family_2006_2009.csv')
MDO_M_16 = pd.read_csv('Data/multi_family_2016_2019.csv')

# Mortgage rates quarterly
ratesQ_06 = pd.read_csv('Data/MORTGAGE30USQ_06_09.csv')
ratesQ_16 = pd.read_csv('Data/MORTGAGE30USQ_16_19.csv')

In [17]:
ratesQ_16.head()

         DATE  MORTGAGE30US
0  2016-01-01      3.738462
1  2016-04-01      3.589231
2  2016-07-01      3.446154
3  2016-10-01      3.842308
4  2017-01-01      4.173077

In [8]:
# Data from second source
D1 = pd.read_csv('Data/sf_const_2006_2009.csv')
D2 = pd.read_csv('Data/sf_const_2016_2019.csv')

In [76]:
D2.columns

Index(['period_id', 'period_name', 'period_date', 'category_id',
       'category_code', 'category_desc', 'category_indent', 'datatype_id',
       'datatype_code', 'datatype_desc', 'datatype_unit', 'error_type_id',
       'error_type_code', 'error_type_desc', 'error_type_unit', 'geo_id',
       'geo_code', 'geo_desc', 'is_adjusted', 'value'],
      dtype='object')

In [83]:
D1_f['period_date'].nunique()

61

In [95]:
D1_f = D1[(D1.geo_desc == 'United States')]
D1_f = D1_f[(D1_f.datatype_desc == 'Single-family Units')]
D1_f = D1_f[(D1_f.category_desc == 'Housing Units Started')]
D1_f = D1_f[['period_date', 'value']]
D1_f = D1_f.rename(columns={'period_date': 'DATE', 'value': 'Single family units in 1000\'s'})
# Value = thousands of single family housing units started
D1_f.set_index("DATE", inplace=True)
D1_f.head()

            Single family units in 1000's
DATE
2005-12-15                          107.9
2006-01-15                          121.0
2006-02-15                          123.6
2006-03-15                          137.7
2006-04-15                          134.8

In [96]:
D2_f = D2[(D2.geo_desc == 'United States')]
D2_f = D2_f[(D2_f.datatype_desc == 'Single-family Units')]
D2_f = D2_f[(D2_f.category_desc == 'Housing Units Started')]
D2_f = D2_f[['period_date', 'value']]
D2_f = D2_f.rename(columns={'period_date': 'DATE', 'value': 'Single family units in 1000\'s'})
# Value = thousands of single family housing units started
D2_f.set_index("DATE", inplace=True)
D2_f.head()

            Single family units in 1000's
DATE
2016-01-15                           50.2
2016-02-15                           58.0
2016-03-15                           62.2
2016-04-15                           72.5
2016-05-15                           70.2